<script setup>
const GoTop = ref(false);
const GoScroll = () => {
  GoTop.value = scrollY > 120;
};
function Top() {
  window.scrollTo({ top: 0, behavior: 'smooth' });
}

onMounted(() => {
  window.addEventListener('scroll', GoScroll);
});
onBeforeUnmount(() => {
	window.removeEventListener('scroll', GoScroll);
});
</script>
<template>
	<div 
	:class="{ 'opacity-100 right-0': GoTop }"
	class="fixed bottom-[20%] -right-20 w-[40px] sm:w-[50px] h-[190px] sm:h-[240px] transition-all duration-500 cursor-pointer opacity-0 z-30 bg-gray-50 flex justify-center items-center rounded-tl-2xl rounded-bl-2xl drop-shadow-2xl"
	>
		<ul class="flex flex-col justify-center items-center space-y-6">
			<li class="flex flex-col justify-center items-center space-y-1">
				<a href="https://line.me/R/ti/p/@yew4806b?oat_content=url" target="_blank">
					<svg 
					class="w-6 h-6 sm:w-8 sm:h-8 fill-black" 
					id="_圖層_2" data-name="圖層 2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 383.67 367.32">
						<g id="_圖層_1-2" data-name="圖層 1">
						<path d="M383.67,145.51v21.71c-.25,1.07-.5,2.13-.74,3.2-1.89,8.73-3.11,17.68-5.78,26.16-7.51,23.82-22.09,43.33-38.94,61.3-19.11,20.37-40.77,37.78-63.2,54.27-24.3,17.88-49.19,34.89-75.89,49.03-5.08,2.69-10.73,4.65-16.35,5.89-5.2,1.14-7.87-1.82-7.88-7.23,0-1.48,.2-2.98,.42-4.45,1.02-6.77,2.22-13.51,3.11-20.3,1.98-15.02-1.49-20.14-16.41-23.61-10.53-2.45-21.33-3.82-31.72-6.72-41.22-11.5-76.76-32.23-102.34-67.24C-1.37,197.37-8.32,153.41,10.42,106.84,25.03,70.52,51.9,44.8,85.87,26.39,129.63,2.69,176.45-4.38,225.5,2.51c40.02,5.62,75.97,20.71,106.61,47.37,23.81,20.71,40.68,45.98,48.11,76.99,1.47,6.14,2.31,12.43,3.45,18.65Zm-192.99,6.21c.25-.11,.5-.23,.74-.34,.74,.95,1.5,1.88,2.21,2.84,11.86,16.18,23.62,32.45,35.69,48.47,1.7,2.25,4.75,4.31,7.47,4.8,6.69,1.2,11.29-3.77,11.3-11.46,.03-24.32,.02-48.64-.01-72.96,0-1.48-.18-3-.53-4.43-1.04-4.28-4.82-7.35-9.11-7.56-4.2-.21-8.42,2.61-9.71,6.78-.54,1.75-.73,3.67-.73,5.51-.06,13.72-.03,27.44-.04,41.16,0,1.02-.14,2.04-.26,3.67-1.06-1.36-1.68-2.12-2.27-2.92-11.96-16.27-23.89-32.55-35.87-48.8-3.6-4.88-7.32-6.31-11.81-4.76-4.63,1.6-6.76,4.94-6.76,10.78-.02,17.46,0,34.92,0,52.38,0,7.73-.09,15.47,.06,23.2,.12,6.15,5.28,10.4,11.29,9.58,4.9-.67,8.32-4.77,8.34-10.33,.06-15.2,.02-30.41,.02-45.61Zm91.05-20.47c1.51,0,2.85,0,4.18,0,7.61,0,15.22,.07,22.82-.03,6.64-.09,10.84-4.23,10.74-10.33-.1-5.86-4.39-9.8-10.85-9.82-11.97-.04-23.95-.04-35.92,0-7.02,.02-11.07,4.13-11.07,11.23-.02,24.82-.03,49.64,0,74.46,0,6.95,3.97,10.94,10.84,10.96,12.1,.04,24.2,.03,36.29-.01,1.35,0,2.76-.1,4.03-.52,4.69-1.54,7.16-5.69,6.6-10.83-.48-4.47-3.89-8.12-8.65-8.31-8.22-.33-16.45-.2-24.68-.27-1.43-.01-2.87-.12-4.17-.18v-18.08c9.06,0,17.78,.02,26.49,0,6.74-.02,11.05-3.91,11.1-9.93,.05-6.08-4.16-10.11-10.89-10.2-7.36-.1-14.72-.03-22.08-.03-1.57,0-3.14,0-4.79,0v-18.09Zm-192.89,56.52c0-2.08,0-3.43,0-4.78,0-19.94,0-39.89-.01-59.83,0-1.49,.07-3.03-.26-4.46-1.06-4.6-5.69-7.95-10.25-7.61-4.94,.37-8.9,4.19-9.14,9.21-.22,4.6-.12,9.22-.12,13.83,0,20.82-.03,41.63,.01,62.44,.01,6.68,3.65,11.04,9.47,11.1,12.96,.13,25.93,.11,38.89,0,5.32-.05,9.37-4.33,9.52-9.58,.15-5.27-3.56-9.83-8.93-10.07-8.09-.36-16.19-.2-24.29-.25-1.47-.01-2.94,0-4.89,0Zm47.7-28.3h-.03c0,12.35-.07,24.7,.06,37.05,.02,2.16,.47,4.51,1.44,6.41,2,3.91,6.73,5.67,10.88,4.54,4.32-1.17,7.29-4.9,7.3-9.7,.05-25.57,.03-51.14,0-76.71,0-1.1-.19-2.25-.55-3.28-1.55-4.44-6.16-7.3-10.52-6.64-4.96,.76-8.52,4.63-8.56,9.79-.1,12.85-.03,25.69-.03,38.54Z"/>
						</g>
					</svg>
				</a>
				<span class="text-[10px] text-black txt-thin xl:font-medium hidden sm:flex">LINE@</span>
			</li>
			<li class="flex flex-col justify-center items-center space-y-1">
				<a 
				href="https://www.facebook.com/onepieceanime25tw" 
				target="_blank">
				<svg 
				class="w-6 h-6 sm:w-8 sm:h-8"
				id="_圖層_2" data-name="圖層 2" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 135 135">
				<g id="Graphic_Elements" data-name="Graphic Elements">
					<g>
					<path class="fill-gray-950" d="M135,67.5C135,30.22,104.78,0,67.5,0S0,30.22,0,67.5c0,33.69,24.68,61.62,56.95,66.68v-47.17h-17.14v-19.51h17.14v-14.87c0-16.92,10.08-26.26,25.5-26.26,7.39,0,15.11,1.32,15.11,1.32v16.61h-8.51c-8.38,0-11,5.2-11,10.54v12.66h18.72l-2.99,19.51h-15.73v47.17c32.27-5.06,56.95-32.99,56.95-66.68Z"/>
					<path class="fill-gray-50" d="M93.77,87.01l2.99-19.51h-18.72v-12.66c0-5.34,2.61-10.54,11-10.54h8.51V27.69s-7.72-1.32-15.11-1.32c-15.42,0-25.5,9.34-25.5,26.26v14.87h-17.14v19.51h17.14v47.17c3.44,.54,6.96,.82,10.55,.82s7.11-.28,10.55-.82v-47.17h15.73Z"/>
					</g>
				</g>
				</svg>
				</a>
				<span class="text-[10px] text-black txt-thin xl:font-medium hidden sm:flex">FB</span>
			</li>
			<!-- <li class="flex flex-col justify-center items-center space-y-1">
				<a 
				href="/"
				target="_blank"
				class="bg-black text-gray-50 w-6 h-6 sm:w-8 sm:h-8 rounded-full text-[12px] flex justify-center items-center">
					in
				</a>
				<span class="text-[10px] text-black txt-thin xl:font-medium hidden sm:flex">訂位</span>
			</li> -->
			<li class="flex flex-col justify-center items-center space-y-1">
				<button
				@click="Top">
                    <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="1.5" stroke="currentColor" class="w-4 h-4 sm:w-6 sm:h-6 text-gray-950">
                    <path stroke-linecap="round" stroke-linejoin="round" d="M4.5 10.5 12 3m0 0 7.5 7.5M12 3v18" />
                    </svg>
				</button>
				<span class="text-[10px] text-black txt-thin xl:font-medium hidden sm:flex">回頂部</span>
			</li>
		</ul>
	</div>
</template>